import math

def area(r):
    '''
    Возвращает площадь окружности по её радиусу.

        Параметр:
            r(int / float): радиус окружности

        Возвращаемое значение:
            area(float): площадь окружности (π * r²)
    '''

    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности по её радиусу.

        Параметр:
            r(int / float): радиус окружности

        Возвращаемое значение:
            perimeter(float): длина окружности (2 * π * r)
    '''

    return 2 * math.pi * r
