def area(a):
    '''
    Возвращает площадь квадрата по его стороне.

        Параметры:
            a (int/float): сторона квадрата

        Возвращаемое значение:
            area (int/float): площадь квадрата (a²)
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по его стороне.

        Параметры:
            a (int/float): сторона квадрата

        Возвращаемое значение:
            perimeter (int/float): периметр квадрата (4 * a)
    '''
    return 4 * a