def area(a, h):
    """
    Возвращает площадь треугольника по стороне и высоте.

        Параметры:
            a (int/float): сторона треугольника
            h (int/float): высота, проведённая к этой стороне
    
        Возвращаемое значение:
            area (int/float): площадь треугольника (a * h / 2)
    """
    return a * h / 2


def perimeter(a, b, c):
    """
    Возвращает периметр треугольника по трём сторонам.

        Параметры:
            a (int/float): первая сторона треугольника
            b (int/float): вторая сторона треугольника
            c (int/float): третья сторона треугольника

        Возвращаемое значение:
            perimeter (int/float): периметр треугольника (a + b + c)
    """
    return a + b + c